
using System;
using System.ComponentModel.Design;
using Lab2csharp;


namespace Lab2csharp
{


    class Program
    {
        public static void Main(string[] args)
        {
            Task1.Exercise1(args);
            Task2.Exercise2(args);
            //Task3.Exercise3(args);
            //Task4.Exercise4(args);
            //Task5.Exercise5(args);

            
        }





        /*3. Створити програми для роз’язування задач згідно свого варіанта засобами ООП.
        Введення/виведення даних супроводжувати відповідними повідомленнями. Передбачити
        захист від введення некоректних даних з клавіатури. Виконати завдання двома способами:
        А) З клавіатури вводиться одновимірний масив n цілих чисел.
        Б) Заповнити масив n цілих чисел значеннями за допомогою генератора
        псевдовипадкових чисел з відрізка [-100; 100].*/
        //variant 7
        /*Визначити 1) максимальний за модулем елемент масиву; 2) суму елементів масиву,
        розташованих після останнього нульового елемента.*/
    


    }
    
}